tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf6680_tdd.h
#define B1EID16                       1091
#define B1SIDL_EID16                  1092
#define B1EID17                       1093
#define B1SIDL_EID17                  1094
#define B1SIDL_EXIDE                  1095
#define B1SIDL_EXID                   1096
#define B1EXID                        1097
#define B1SRR                         1098
#define B1SIDL_SRR                    1099
#define B1SIDL_SID0                   1100
#define B1SID0                        1101
#define B1SIDL_SID1                   1102
#define B1SID1                        1103
#define B1SIDL_SID2                   1104
#define B1SID2                        1105
#define B1EIDH                        1106
#define B1EID8                        1107
#define B1EIDH_EID8                   1108
#define B1EID9                        1109
#define B1EIDH_EID9                   1110
#define B1EIDH_EID10                  1111
#define B1EID10                       1112
#define B1EIDH_EID11                  1113
#define B1EID11                       1114
#define B1EIDH_EID12                  1115
#define B1EID12                       1116
#define B1EIDH_EID13                  1117
#define B1EID13                       1118
#define B1EIDH_EID14                  1119
#define B1EID14                       1120
#define B1EIDH_EID15                  1121
#define B1EID15                       1122
#define B1EIDL                        1123
#define B1EID0                        1124
#define B1EIDL_EID0                   1125
#define B1EID1                        1126
#define B1EIDL_EID1                   1127
#define B1EID2                        1128
#define B1EIDL_EID2                   1129
#define B1EID3                        1130
#define B1EIDL_EID3                   1131
#define B1EID4                        1132
#define B1EIDL_EID4                   1133
#define B1EID5                        1134
#define B1EIDL_EID5                   1135
#define B1EID6                        1136
#define B1EIDL_EID6                   1137
#define B1EIDL_EID7                   1138
#define B1EID7                        1139
#define B1DLC                         1140
#define B1DLC0                        1141
#define B1DLC_DLC0                    1142
#define B1DLC1                        1143
#define B1DLC_DLC1                    1144
#define B1DLC2                        1145
#define B1DLC_DLC2                    1146
#define B1DLC3                        1147
#define B1DLC_DLC3                    1148
#define B1RB0                         1149
#define B1DLC_RESRB0                  1150
#define B1DLC_RB0                     1151
#define B1RB1                         1152
#define B1DLC_RESRB1                  1153
#define B1DLC_RB1                     1154
#define B1DLC_RXRTR                   1155
#define B1RXRTR                       1156
#define B1DLC_TXRTR                   1157
#define B1D0                          1158
#define B1D00                         1159
#define B1D01                         1160
#define B1D02                         1161
#define B1D03                         1162
#define B1D04                         1163
#define B1D05                         1164
#define B1D06                         1165
#define B1D07                         1166
#define B1D1                          1167
#define B1D10                         1168
#define B1D11                         1169
#define B1D12                         1170
#define B1D13                         1171
#define B1D14                         1172
#define B1D15                         1173
#define B1D16                         1174
#define B1D17                         1175
#define B1D2                          1176
#define B1D20                         1177
#define B1D21                         1178
#define B1D22                         1179
#define B1D23                         1180
#define B1D24                         1181
#define B1D25                         1182
#define B1D26                         1183
#define B1D27                         1184
#define B1D3                          1185
#define B1D30                         1186
#define B1D31                         1187
#define B1D32                         1188
#define B1D33                         1189
#define B1D34                         1190
#define B1D35                         1191
#define B1D36                         1192
#define B1D37                         1193
#define B1D4                          1194
#define B1D40                         1195
#define B1D41                         1196
#define B1D42                         1197
#define B1D43                         1198
#define B1D44                         1199
#define B1D45                         1200
#define B1D46                         1201
#define B1D47                         1202
#define B1D5                          1203
#define B1D50                         1204
#define B1D51                         1205
#define B1D52                         1206
#define B1D53                         1207
#define B1D54                         1208
#define B1D55                         1209
#define B1D56                         1210
#define B1D57                         1211
#define B1D6                          1212
#define B1D60                         1213
#define B1D61                         1214
#define B1D62                         1215
#define B1D63                         1216
#define B1D64                         1217
#define B1D65                         1218
#define B1D66                         1219
#define B1D67                         1220
#define B1D7                          1221
#define B1D70                         1222
#define B1D71                         1223
#define B1D72                         1224
#define B1D73                         1225
#define B1D74                         1226
#define B1D75                         1227
#define B1D76                         1228
#define B1D77                         1229
#define CANSTAT_RO8                   1230
#define CANSTAT_RO8_EICODE0           1231
#define CANSTAT_RO8_EICODE1_ICODE0    1232
#define CANSTAT_RO8_EICODE2_ICODE1    1233
#define CANSTAT_RO8_EICODE3_ICODE2    1234
#define CANSTAT_RO8_EICODE4           1235
#define CANSTAT_RO8_OPMODE0           1236
#define CANSTAT_RO8_OPMODE1           1237
#define CANSTAT_RO8_OPMODE2           1238
#define CANCON_RO8                    1239
#define CANCON_RO8_FP0                1240
#define CANCON_RO8_WIN0_FP1           1241
#define CANCON_RO8_WIN1_FP2           1242
#define CANCON_RO8_WIN2_FP3           1243
#define CANCON_RO8_ABAT               1244
#define CANCON_RO8_REQOP0             1245
#define CANCON_RO8_REQOP1             1246
#define CANCON_RO8_REQOP2             1247
#define B2CON                         1248
#define B2FILHIT0                     1249
#define B2TXPRI0                      1250
#define B2CON_FILHIT0_TXPRI0          1251
#define B2CON_FILHIT0                 1252
#define B2CON_TXPRI0                  1253
#define B2FILHIT1                     1254
#define B2TXPRI1                      1255
#define B2CON_FILHIT1_TXPRI1          1256
#define B2CON_FILHIT1                 1257
#define B2CON_TXPRI1                  1258
#define B2CON_RTREN                   1259
#define B2FILHIT2                     1260
#define B2RTREN                       1261
#define B2CON_FILHIT2                 1262
#define B2CON_FILHIT2_RTREN           1263
#define B2FILHIT3                     1264
#define B2CON_FILHIT3                 1265
#define B2TXREQ                       1266
#define B2CON_FILHIT3_TXREQ           1267
#define B2CON_TXREQ                   1268
#define B2FILHIT4                     1269
#define B2CON_TXERR                   1270
#define B2CON_FILHIT4_TXERR           1271
#define B2CON_FILHIT4                 1272
#define B2TXERR                       1273
#define B2CON_RTRRO_TXLARB            1274
#define B2RTRRO                       1275
#define B2TXLARB                      1276
#define B2CON_TXLARB                  1277
#define B2CON_RTRRO                   1278
#define B2TXABT                       1279
#define B2RXM1                        1280
#define B2CON_RXM1_TXABT              1281
#define B2CON_RXM1                    1282
#define B2CON_TXABT                   1283
#define B2TXB3IF                      1284
#define B2CON_TXBIF                   1285
#define B2CON_RXFUL                   1286
#define B2RXFUL                       1287
#define B2CON_RXFUL_TXBIF             1288
#define B2SIDH                        1289
#define B2SID3                        1290
#define B2SIDH_SID3                   1291
#define B2SID4                        1292
#define B2SIDH_SID4                   1293
#define B2SIDH_SID5                   1294
#define B2SID5                        1295
#define B2SID6                        1296
#define B2SIDH_SID6                   1297
#define B2SIDH_SID7                   1298
#define B2SID7                        1299
#define B2SIDH_SID8                   1300
#define B2SID8                        1301
#define B2SIDH_SID9                   1302
#define B2SID9                        1303
#define B2SID10                       1304
#define B2SIDH_SID10                  1305
#define B2SIDL                        1306
#define B2SIDL_EID16                  1307
#define B2EID16                       1308
#define B2SIDL_EID17                  1309
#define B2EID17                       1310
#define B2EXID                        1311
#define B2SIDL_EXIDE                  1312
#define B2SIDL_EXID                   1313
#define B2EXIDE                       1314
#define B2SRR                         1315
#define B2SIDL_SRR                    1316
#define B2SIDL_SID0                   1317
#define B2SID0                        1318
#define B2SIDL_SID1                   1319
#define B2SID1                        1320
#define B2SIDL_SID2                   1321
#define B2SID2                        1322
#define B2EIDH                        1323
#define B2EID8                        1324
#define B2EIDH_EID8                   1325
#define B2EID9                        1326
#define B2EIDH_EID9                   1327
#define B2EID10                       1328
#define B2EIDH_EID10                  1329
#define B2EID11                       1330
#define B2EIDH_EID11                  1331
#define B2EID12                       1332
#define B2EIDH_EID12                  1333
#define B2EID13                       1334
#define B2EIDH_EID13                  1335
#define B2EID14                       1336
#define B2EIDH_EID14                  1337
#define B2EID15                       1338
#define B2EIDH_EID15                  1339
#define B2EIDL                        1340
#define B2EID0                        1341
#define B2EIDL_EID0                   1342
#define B2EID1                        1343
#define B2EIDL_EID1                   1344
#define B2EID2                        1345
#define B2EIDL_EID2                   1346
#define B2EID3                        1347
#define B2EIDL_EID3                   1348
#define B2EID4                        1349
#define B2EIDL_EID4                   1350
#define B2EID5                        1351
#define B2EIDL_EID5                   1352
#define B2EID6                        1353
#define B2EIDL_EID6                   1354
#define B2EID7                        1355
#define B2EIDL_EID7                   1356
#define B2DLC                         1357
#define B2DLC0                        1358
#define B2DLC_DLC0                    1359
#define B2DLC1                        1360
#define B2DLC_DLC1                    1361
#define B2DLC2                        1362
#define B2DLC_DLC2                    1363
#define B2DLC3                        1364
#define B2DLC_DLC3                    1365
#define B2RB0                         1366
#define B2DLC_RESRB0                  1367
#define B2DLC_RB0                     1368
#define B2RB1                         1369
#define B2DLC_RESRB1                  1370
#define B2DLC_RB1                     1371
#define B2DLC_RXRTR                   1372
#define B2RXRTR                       1373
#define B2DLC_TXRTR                   1374
#define B2D0                          1375
#define B2D00                         1376
#define B2D01                         1377
#define B2D02                         1378
#define B2D03                         1379
#define B2D04                         1380
#define B2D05                         1381
#define B2D06                         1382
#define B2D07                         1383
#define B2D1                          1384
#define B2D10                         1385
#define B2D11                         1386
#define B2D12                         1387
#define B2D13                         1388
#define B2D14                         1389
#define B2D15                         1390
#define B2D16                         1391
#define B2D17                         1392
#define B2D2                          1393
#define B2D20                         1394
#define B2D21                         1395
#define B2D22                         1396
#define B2D23                         1397
#define B2D24                         1398
#define B2D25                         1399
#define B2D26                         1400
#define B2D27                         1401
#define B2D3                          1402
#define B2D30                         1403
#define B2D31                         1404
#define B2D32                         1405
#define B2D33                         1406
#define B2D34                         1407
#define B2D35                         1408
#define B2D36                         1409
#define B2D37                         1410
#define B2D4                          1411
#define B2D40                         1412
#define B2D41                         1413
#define B2D42                         1414
#define B2D43                         1415
#define B2D44                         1416
#define B2D45                         1417
#define B2D46                         1418
#define B2D47                         1419
#define B2D5                          1420
#define B2D50                         1421
#define B2D51                         1422
#define B2D52                         1423
#define B2D53                         1424
#define B2D54                         1425
#define B2D55                         1426
#define B2D56                         1427
#define B2D57                         1428
#define B2D6                          1429
#define B2D60                         1430
#define B2D61                         1431
#define B2D62                         1432
#define B2D63                         1433
#define B2D64                         1434
#define B2D65                         1435
#define B2D66                         1436
#define B2D67                         1437
#define B2D7                          1438
#define B2D70                         1439
#define B2D71                         1440
#define B2D72                         1441
#define B2D73                         1442
#define B2D74                         1443
#define B2D75                         1444
#define B2D76                         1445
#define B2D77                         1446
#define CANSTAT_RO7                   1447
#define CANSTAT_RO7_EICODE0           1448
#define CANSTAT_RO7_EICODE1_ICODE0    1449
#define CANSTAT_RO7_EICODE2_ICODE1    1450
#define CANSTAT_RO7_EICODE3_ICODE2    1451
#define CANSTAT_RO7_EICODE4           1452
#define CANSTAT_RO7_OPMODE0           1453
#define CANSTAT_RO7_OPMODE1           1454
#define CANSTAT_RO7_OPMODE2           1455
#define CANCON_RO7                    1456
#define CANCON_RO7_FP0                1457
#define CANCON_RO7_WIN0_FP1           1458
#define CANCON_RO7_WIN1_FP2           1459
#define CANCON_RO7_WIN2_FP3           1460
#define CANCON_RO7_ABAT               1461
#define CANCON_RO7_REQOP0             1462
#define CANCON_RO7_REQOP1             1463
#define CANCON_RO7_REQOP2             1464
#define B3CON                         1465
#define B3CON_TXPRI0                  1466
#define B3CON_FILHIT0                 1467
#define B3TXPRI0                      1468
#define B3CON_FILHIT0_TXPRI0          1469
#define B3FILHIT0                     1470
#define B3CON_FILHIT1                 1471
#define B3CON_TXPRI1                  1472
#define B3TXPRI1                      1473
#define B3FILHIT1                     1474
#define B3CON_FILHIT1_TXPRI1          1475
#define B3CON_FILHIT2                 1476
#define B3CON_FILHIT2_RTREN           1477
#define B3RTREN                       1478
#define B3FILHIT2                     1479
#define B3CON_RTREN                   1480
#define B3CON_FILHIT3_TXREQ           1481
#define B3TXREQ                       1482
#define B3CON_FILHIT3                 1483
#define B3FILHIT3                     1484
#define B3CON_TXREQ                   1485
#define B3TXERR                       1486
#define B3CON_FILHIT4                 1487
#define B3CON_TXERR                   1488
#define B3CON_FILHIT4_TXERR           1489
#define B3FILHIT4                     1490
#define B3CON_RTRRO                   1491
#define B3CON_TXLARB                  1492
#define B3RTRRO                       1493
#define B3CON_RTRRO_TXLARB            1494
#define B3TXLARB                      1495
#define B3CON_RXM1                    1496
#define B3TXABT                       1497
#define B3CON_RXM1_TXABT              1498
#define B3CON_TXABT                   1499
#define B3RXM1                        1500
#define B3CON_RXFUL_TXBIF             1501
#define B3RXFUL                       1502
#define B3TXB3IF                      1503
#define B3CON_RXFUL                   1504
#define B3CON_TXBIF                   1505
#define B3SIDH                        1506
#define B3SIDH_SID3                   1507
#define B3SID3                        1508
#define B3SIDH_SID4                   1509
#define B3SID4                        1510
#define B3SIDH_SID5                   1511
#define B3SID5                        1512
#define B3SIDH_SID6                   1513
#define B3SID6                        1514
#define B3SIDH_SID7                   1515
#define B3SID7                        1516
#define B3SIDH_SID8                   1517
#define B3SID8                        1518
#define B3SIDH_SID9                   1519
#define B3SID9                        1520
#define B3SID10                       1521
#define B3SIDH_SID10                  1522
#define B3SIDL                        1523
#define B3EID16                       1524
#define B3SIDL_EID16                  1525
#define B3EID17                       1526
#define B3SIDL_EID17                  1527
#define B3EXIDE                       1528
#define B3SIDL_EXIDE                  1529
#define B3SIDL_EXID                   1530
#define B3EXID                        1531
#define B3SIDL_SRR                    1532
#define B3SRR                         1533
#define B3SIDL_SID0                   1534
#define B3SID0                        1535
#define B3SIDL_SID1                   1536
#define B3SID1                        1537
#define B3SIDL_SID2                   1538
#define B3SID2                        1539
#define B3EIDH                        1540
#define B3EID8                        1541
#define B3EIDH_EID8                   1542
#define B3EID9                        1543
#define B3EIDH_EID9                   1544
#define B3EIDH_EID10                  1545
#define B3EID10                       1546
#define B3EIDH_EID11                  1547
#define B3EID11                       1548
#define B3EIDH_EID12                  1549
#define B3EID12                       1550
#define B3EIDH_EID13                  1551
#define B3EID13                       1552
#define B3EIDH_EID14                  1553
#define B3EID14                       1554
#define B3EIDH_EID15                  1555
#define B3EID15                       1556
#define B3EIDL                        1557
#define B3EID0                        1558
#define B3EIDL_EID0                   1559
#define B3EID1                        1560
#define B3EIDL_EID1                   1561
#define B3EID2                        1562
#define B3EIDL_EID2                   1563
#define B3EID3                        1564
#define B3EIDL_EID3                   1565
#define B3EID4                        1566
#define B3EIDL_EID4                   1567
#define B3EID5                        1568
#define B3EIDL_EID5                   1569
#define B3EID6                        1570
#define B3EIDL_EID6                   1571
#define B3EID7                        1572
#define B3EIDL_EID7                   1573
#define B3DLC                         1574
#define B3DLC_DLC0                    1575
#define B3DLC0                        1576
#define B3DLC_DLC1                    1577
#define B3DLC1                        1578
#define B3DLC_DLC2                    1579
#define B3DLC2                        1580
#define B3DLC_DLC3                    1581
#define B3DLC3                        1582
#define B3DLC_RB0                     1583
#define B3DLC_RESRB0                  1584
#define B3RB0                         1585
#define B3DLC_RB1                     1586
#define B3DLC_RESRB1                  1587
#define B3RB1                         1588
#define B3DLC_TXRTR                   1589
#define B3RXRTR                       1590
#define B3DLC_RXRTR                   1591
#define B3D0                          1592
#define B3D00                         1593
#define B3D01                         1594
#define B3D02                         1595
#define B3D03                         1596
#define B3D04                         1597
#define B3D05                         1598
#define B3D06                         1599
#define B3D07                         1600
#define B3D1                          1601
#define B3D10                         1602
#define B3D11                         1603
#define B3D12                         1604
#define B3D13                         1605
#define B3D14                         1606
#define B3D15                         1607
#define B3D16                         1608
#define B3D17                         1609
#define B3D2                          1610
#define B3D20                         1611
#define B3D21                         1612
#define B3D22                         1613
#define B3D23                         1614
#define B3D24                         1615
#define B3D25                         1616
#define B3D26                         1617
#define B3D27                         1618
#define B3D3                          1619
#define B3D30                         1620
#define B3D31                         1621
#define B3D32                         1622
#define B3D33                         1623
#define B3D34                         1624
#define B3D35                         1625
#define B3D36                         1626
#define B3D37                         1627
#define B3D4                          1628
#define B3D40                         1629
#define B3D41                         1630
#define B3D42                         1631
#define B3D43                         1632
#define B3D44                         1633
#define B3D45                         1634
#define B3D46                         1635
#define B3D47                         1636
#define B3D5                          1637
#define B3D50                         1638
#define B3D51                         1639
#define B3D52                         1640
#define B3D53                         1641
#define B3D54                         1642
#define B3D55                         1643
#define B3D56                         1644
#define B3D57                         1645
#define B3D6                          1646
#define B3D60                         1647
#define B3D61                         1648
