tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf6680_tdd.h
#define TXB2D40                       2765
#define TXB2D41                       2766
#define TXB2D42                       2767
#define TXB2D43                       2768
#define TXB2D44                       2769
#define TXB2D45                       2770
#define TXB2D46                       2771
#define TXB2D47                       2772
#define TXB2D5                        2773
#define TXB2D50                       2774
#define TXB2D51                       2775
#define TXB2D52                       2776
#define TXB2D53                       2777
#define TXB2D54                       2778
#define TXB2D55                       2779
#define TXB2D56                       2780
#define TXB2D57                       2781
#define TXB2D6                        2782
#define TXB2D60                       2783
#define TXB2D61                       2784
#define TXB2D62                       2785
#define TXB2D63                       2786
#define TXB2D64                       2787
#define TXB2D65                       2788
#define TXB2D66                       2789
#define TXB2D67                       2790
#define TXB2D7                        2791
#define TXB2D70                       2792
#define TXB2D71                       2793
#define TXB2D72                       2794
#define TXB2D73                       2795
#define TXB2D74                       2796
#define TXB2D75                       2797
#define TXB2D76                       2798
#define TXB2D77                       2799
#define CANSTAT_RO3                   2800
#define CANSTAT_RO3_EICODE0           2801
#define CANSTAT_RO3_EICODE1_ICODE0    2802
#define CANSTAT_RO3_EICODE2_ICODE1    2803
#define CANSTAT_RO3_EICODE3_ICODE2    2804
#define CANSTAT_RO3_EICODE4           2805
#define CANSTAT_RO3_OPMODE0           2806
#define CANSTAT_RO3_OPMODE1           2807
#define CANSTAT_RO3_OPMODE2           2808
#define CANCON_RO3                    2809
#define CANCON_RO3_FP0                2810
#define CANCON_RO3_WIN0_FP1           2811
#define CANCON_RO3_WIN1_FP2           2812
#define CANCON_RO3_WIN2_FP3           2813
#define CANCON_RO3_ABAT               2814
#define CANCON_RO3_REQOP0             2815
#define CANCON_RO3_REQOP1             2816
#define CANCON_RO3_REQOP2             2817
#define TXB1CON                       2818
#define TXB1PRI0                      2819
#define TXB1CON_TXPRI0                2820
#define TXB1PRI1                      2821
#define TXB1CON_TXPRI1                2822
#define TXB1REQ                       2823
#define TXB1CON_TXREQ                 2824
#define TXB1CON_TXERR                 2825
#define TXB1ERR                       2826
#define TXB1LARB                      2827
#define TXB1CON_TXLARB                2828
#define TXB1ABT                       2829
#define TXB1CON_TXABT                 2830
#define TXB1CON_TX1IF                 2831
#define TXBIFTXB1CON                  2832
#define TXB1CON_TXBIF                 2833
#define TXB1SIDH                      2834
#define TXB1SIDH_SID3                 2835
#define TXB1SID3                      2836
#define TXB1SIDH_SID4                 2837
#define TXB1SID4                      2838
#define TXB1SIDH_SID5                 2839
#define TXB1SID5                      2840
#define TXB1SIDH_SID6                 2841
#define TXB1SID6                      2842
#define TXB1SIDH_SID7                 2843
#define TXB1SID7                      2844
#define TXB1SIDH_SID8                 2845
#define TXB1SID8                      2846
#define TXB1SIDH_SID9                 2847
#define TXB1SID9                      2848
#define TXB1SID10                     2849
#define TXB1SIDH_SID10                2850
#define TXB1SIDL                      2851
#define TXB1SIDL_EID16                2852
#define TXB1EID16                     2853
#define TXB1SIDL_EID17                2854
#define TXB1EID17                     2855
#define TXB1EXIDE                     2856
#define TXB1SIDL_EXIDE                2857
#define TXB1SID0                      2858
#define TXB1SIDL_SID0                 2859
#define TXB1SID1                      2860
#define TXB1SIDL_SID1                 2861
#define TXB1SID2                      2862
#define TXB1SIDL_SID2                 2863
#define TXB1EIDH                      2864
#define TXB1EID8                      2865
#define TXB1EIDH_EID8                 2866
#define TXB1EID9                      2867
#define TXB1EIDH_EID9                 2868
#define TXB1EID10                     2869
#define TXB1EIDH_EID10                2870
#define TXB1EID11                     2871
#define TXB1EIDH_EID11                2872
#define TXB1EID12                     2873
#define TXB1EIDH_EID12                2874
#define TXB1EID13                     2875
#define TXB1EIDH_EID13                2876
#define TXB1EID14                     2877
#define TXB1EIDH_EID14                2878
#define TXB1EID15                     2879
#define TXB1EIDH_EID15                2880
#define TXB1EIDL                      2881
#define TXB1EIDL_EID0                 2882
#define TXB1EID0                      2883
#define TXB1EIDL_EID1                 2884
#define TXB1EID1                      2885
#define TXB1EIDL_EID2                 2886
#define TXB1EID2                      2887
#define TXB1EIDL_EID3                 2888
#define TXB1EID3                      2889
#define TXB1EIDL_EID4                 2890
#define TXB1EID4                      2891
#define TXB1EIDL_EID5                 2892
#define TXB1EID5                      2893
#define TXB1EIDL_EID6                 2894
#define TXB1EID6                      2895
#define TXB1EIDL_EID7                 2896
#define TXB1EID7                      2897
#define TXB1DLC                       2898
#define TXB1DLC0                      2899
#define TXB1DLC_DLC0                  2900
#define TXB1DLC_DLC1                  2901
#define TXB1DLC1                      2902
#define TXB1DLC_DLC2                  2903
#define TXB1DLC2                      2904
#define TXB1DLC_DLC3                  2905
#define TXB1DLC3                      2906
#define TXB1RTR                       2907
#define TXB1DLC_TXRTR                 2908
#define TXB1D0                        2909
#define TXB1D00                       2910
#define TXB1D01                       2911
#define TXB1D02                       2912
#define TXB1D03                       2913
#define TXB1D04                       2914
#define TXB1D05                       2915
#define TXB1D06                       2916
#define TXB1D07                       2917
#define TXB1D1                        2918
#define TXB1D10                       2919
#define TXB1D11                       2920
#define TXB1D12                       2921
#define TXB1D13                       2922
#define TXB1D14                       2923
#define TXB1D15                       2924
#define TXB1D16                       2925
#define TXB1D17                       2926
#define TXB1D2                        2927
#define TXB1D20                       2928
#define TXB1D21                       2929
#define TXB1D22                       2930
#define TXB1D23                       2931
#define TXB1D24                       2932
#define TXB1D25                       2933
#define TXB1D26                       2934
#define TXB1D27                       2935
#define TXB1D3                        2936
#define TXB1D30                       2937
#define TXB1D31                       2938
#define TXB1D32                       2939
#define TXB1D33                       2940
#define TXB1D34                       2941
#define TXB1D35                       2942
#define TXB1D36                       2943
#define TXB1D37                       2944
#define TXB1D4                        2945
#define TXB1D40                       2946
#define TXB1D41                       2947
#define TXB1D42                       2948
#define TXB1D43                       2949
#define TXB1D44                       2950
#define TXB1D45                       2951
#define TXB1D46                       2952
#define TXB1D47                       2953
#define TXB1D5                        2954
#define TXB1D50                       2955
#define TXB1D51                       2956
#define TXB1D52                       2957
#define TXB1D53                       2958
#define TXB1D54                       2959
#define TXB1D55                       2960
#define TXB1D56                       2961
#define TXB1D57                       2962
#define TXB1D6                        2963
#define TXB1D60                       2964
#define TXB1D61                       2965
#define TXB1D62                       2966
#define TXB1D63                       2967
#define TXB1D64                       2968
#define TXB1D65                       2969
#define TXB1D66                       2970
#define TXB1D67                       2971
#define TXB1D7                        2972
#define TXB1D70                       2973
#define TXB1D71                       2974
#define TXB1D72                       2975
#define TXB1D73                       2976
#define TXB1D74                       2977
#define TXB1D75                       2978
#define TXB1D76                       2979
#define TXB1D77                       2980
#define CANSTAT_RO2                   2981
#define CANSTAT_RO2_EICODE0           2982
#define CANSTAT_RO2_EICODE1_ICODE0    2983
#define CANSTAT_RO2_EICODE2_ICODE1    2984
#define CANSTAT_RO2_EICODE3_ICODE2    2985
#define CANSTAT_RO2_EICODE4           2986
#define CANSTAT_RO2_OPMODE0           2987
#define CANSTAT_RO2_OPMODE1           2988
#define CANSTAT_RO2_OPMODE2           2989
#define CANCON_RO2                    2990
#define CANCON_RO2_FP0                2991
#define CANCON_RO2_WIN0_FP1           2992
#define CANCON_RO2_WIN1_FP2           2993
#define CANCON_RO2_WIN2_FP3           2994
#define CANCON_RO2_ABAT               2995
#define CANCON_RO2_REQOP0             2996
#define CANCON_RO2_REQOP1             2997
#define CANCON_RO2_REQOP2             2998
#define TXB0CON                       2999
#define TXB0PRI0                      3000
#define TXB0CON_TXPRI0                3001
#define TXB0CON_TXPRI1                3002
#define TXB0PRI1                      3003
#define TXB0REQ                       3004
#define TXB0CON_TXREQ                 3005
#define TXB0CON_TXERR                 3006
#define TXB0ERR                       3007
#define TXB0CON_TXLARB                3008
#define TXB0LARB                      3009
#define TXB0ABT                       3010
#define TXB0CON_TXABT                 3011
#define TXB0CON_TXBIF                 3012
#define TX0IF                         3013
#define TXB0SIDH                      3014
#define TXB0SID3                      3015
#define TXB0SIDH_SID3                 3016
#define TXB0SID4                      3017
#define TXB0SIDH_SID4                 3018
#define TXB0SID5                      3019
#define TXB0SIDH_SID5                 3020
#define TXB0SID6                      3021
#define TXB0SIDH_SID6                 3022
#define TXB0SID7                      3023
#define TXB0SIDH_SID7                 3024
#define TXB0SID8                      3025
#define TXB0SIDH_SID8                 3026
#define TXB0SID9                      3027
#define TXB0SIDH_SID9                 3028
#define TXB0SIDH_SID10                3029
#define TXB0SID10                     3030
#define TXB0SIDL                      3031
#define TXB0EID16                     3032
#define TXB0SIDL_EID16                3033
#define TXB0EID17                     3034
#define TXB0SIDL_EID17                3035
#define TXB0SIDL_EXIDE                3036
#define TXB0EXIDE                     3037
#define TXB0SID0                      3038
#define TXB0SIDL_SID0                 3039
#define TXB0SID1                      3040
#define TXB0SIDL_SID1                 3041
#define TXB0SID2                      3042
#define TXB0SIDL_SID2                 3043
#define TXB0EIDH                      3044
#define TXB0EID8                      3045
#define TXB0EIDH_EID8                 3046
#define TXB0EID9                      3047
#define TXB0EIDH_EID9                 3048
#define TXB0EIDH_EID10                3049
#define TXB0EID10                     3050
#define TXB0EID11                     3051
#define TXB0EIDH_EID11                3052
#define TXB0EIDH_EID12                3053
#define TXB0EID12                     3054
#define TXB0EIDH_EID13                3055
#define TXB0EID13                     3056
#define TXB0EIDH_EID14                3057
#define TXB0EID14                     3058
#define TXB0EIDH_EID15                3059
#define TXB0EID15                     3060
#define TXB0EIDL                      3061
#define TXB0EIDL_EID0                 3062
#define TXB0EID0                      3063
#define TXB0EIDL_EID1                 3064
#define TXB0EID1                      3065
#define TXB0EIDL_EID2                 3066
#define TXB0EID2                      3067
#define TXB0EIDL_EID3                 3068
#define TXB0EID3                      3069
#define TXB0EIDL_EID4                 3070
#define TXB0EID4                      3071
#define TXB0EIDL_EID5                 3072
#define TXB0EID5                      3073
#define TXB0EIDL_EID6                 3074
#define TXB0EID6                      3075
#define TXB0EIDL_EID7                 3076
#define TXB0EID7                      3077
#define TXB0DLC                       3078
#define TXB0DLC0                      3079
#define TXB0DLC_DLC0                  3080
#define TXB0DLC1                      3081
#define TXB0DLC_DLC1                  3082
#define TXB0DLC2                      3083
#define TXB0DLC_DLC2                  3084
#define TXB0DLC3                      3085
#define TXB0DLC_DLC3                  3086
#define TXB0RTR                       3087
#define TXB0DLC_TXRTR                 3088
#define TXB0D0                        3089
#define TXB0D00                       3090
#define TXB0D01                       3091
#define TXB0D02                       3092
#define TXB0D03                       3093
#define TXB0D04                       3094
#define TXB0D05                       3095
#define TXB0D06                       3096
#define TXB0D07                       3097
#define TXB0D1                        3098
#define TXB0D10                       3099
#define TXB0D11                       3100
#define TXB0D12                       3101
#define TXB0D13                       3102
#define TXB0D14                       3103
#define TXB0D15                       3104
#define TXB0D16                       3105
#define TXB0D17                       3106
#define TXB0D2                        3107
#define TXB0D20                       3108
#define TXB0D21                       3109
#define TXB0D22                       3110
#define TXB0D23                       3111
#define TXB0D24                       3112
#define TXB0D25                       3113
#define TXB0D26                       3114
#define TXB0D27                       3115
#define TXB0D3                        3116
#define TXB0D30                       3117
#define TXB0D31                       3118
#define TXB0D32                       3119
#define TXB0D33                       3120
#define TXB0D34                       3121
#define TXB0D35                       3122
#define TXB0D36                       3123
#define TXB0D37                       3124
#define TXB0D4                        3125
#define TXB0D40                       3126
#define TXB0D41                       3127
#define TXB0D42                       3128
#define TXB0D43                       3129
#define TXB0D44                       3130
#define TXB0D45                       3131
#define TXB0D46                       3132
#define TXB0D47                       3133
#define TXB0D5                        3134
#define TXB0D50                       3135
#define TXB0D51                       3136
#define TXB0D52                       3137
#define TXB0D53                       3138
#define TXB0D54                       3139
#define TXB0D55                       3140
#define TXB0D56                       3141
#define TXB0D57                       3142
#define TXB0D6                        3143
#define TXB0D60                       3144
#define TXB0D61                       3145
#define TXB0D62                       3146
#define TXB0D63                       3147
#define TXB0D64                       3148
#define TXB0D65                       3149
#define TXB0D66                       3150
#define TXB0D67                       3151
#define TXB0D7                        3152
#define TXB0D70                       3153
#define TXB0D71                       3154
#define TXB0D72                       3155
#define TXB0D73                       3156
#define TXB0D74                       3157
#define TXB0D75                       3158
#define TXB0D76                       3159
#define TXB0D77                       3160
#define CANSTAT_RO1                   3161
#define CANSTAT_RO1_EICODE0           3162
#define CANSTAT_RO1_EICODE1_ICODE0    3163
#define CANSTAT_RO1_EICODE2_ICODE1    3164
#define CANSTAT_RO1_EICODE3_ICODE2    3165
#define CANSTAT_RO1_EICODE4           3166
#define CANSTAT_RO1_OPMODE0           3167
#define CANSTAT_RO1_OPMODE1           3168
#define CANSTAT_RO1_OPMODE2           3169
#define CANCON_RO1                    3170
#define CANCON_RO1_FP0                3171
#define CANCON_RO1_WIN0_FP1           3172
#define CANCON_RO1_WIN1_FP2           3173
#define CANCON_RO1_WIN2_FP3           3174
#define CANCON_RO1_ABAT               3175
#define CANCON_RO1_REQOP0             3176
#define CANCON_RO1_REQOP1             3177
#define CANCON_RO1_REQOP2             3178
#define RXB1CON                       3179
#define RXB1CON_FILHIT0               3180
#define RXB1FILHIT0                   3181
#define RXB1CON_FILHIT1               3182
#define RXB1FILHIT1                   3183
#define RXB1CON_FILHIT2               3184
#define RXB1FILHIT2                   3185
#define RXB1CON_RTRRO_FILHIT3         3186
#define RXB1CON_RXRTRRO               3187
#define RXRTRR0                       3188
#define RXB1CON_FILHIT3               3189
#define RXB1RTRR0                     3190
#define RXB1FILHIT3                   3191
#define RXB1CON_RXRTRRO_FILHIT3       3192
#define RXB1CON_FILHIT4               3193
#define RXB1FILHIT4                   3194
#define RXB1M0                        3195
#define RXB1CON_RXM0_RTRRO            3196
#define RXB1RTRRO                     3197
#define RXB1CON_RTRRO                 3198
#define RXB1CON_RXM0                  3199
#define RXB1M1                        3200
#define RXB1CON_RXM1                  3201
#define RXB1FUL                       3202
#define RXB1CON_RXFUL                 3203
#define RXB1SIDH                      3204
#define RXB1SID3                      3205
#define RXB1SIDH_SID3                 3206
#define RXB1SID4                      3207
#define RXB1SIDH_SID4                 3208
#define RXB1SID5                      3209
#define RXB1SIDH_SID5                 3210
#define RXB1SID6                      3211
#define RXB1SIDH_SID6                 3212
#define RXB1SID7                      3213
#define RXB1SIDH_SID7                 3214
#define RXB1SID8                      3215
#define RXB1SIDH_SID8                 3216
#define RXB1SID9                      3217
#define RXB1SIDH_SID9                 3218
#define RXB1SIDH_SID10                3219
#define RXB1SID10                     3220
#define RXB1SIDL                      3221
#define RXB1SIDL_EID16                3222
#define RXB1EID16                     3223
#define RXB1SIDL_EID17                3224
#define RXB1EID17                     3225
#define RXB1EXID                      3226
#define RXB1SIDL_EXID                 3227
#define RXB1SRR                       3228
#define RXB1SIDL_SRR                  3229
#define RXB1SID0                      3230
#define RXB1SIDL_SID0                 3231
#define RXB1SIDL_SID1                 3232
#define RXB1SID1                      3233
#define RXB1SIDL_SID2                 3234
#define RXB1SID2                      3235
#define RXB1EIDH                      3236
#define RXB1EID8                      3237
#define RXB1EIDH_EID8                 3238
#define RXB1EID9                      3239
#define RXB1EIDH_EID9                 3240
#define RXB1EIDH_EID10                3241
#define RXB1EID10                     3242
#define RXB1EIDH_EID11                3243
#define RXB1EID11                     3244
#define RXB1EIDH_EID12                3245
#define RXB1EID12                     3246
#define RXB1EID13                     3247
#define RXB1EIDH_EID13                3248
#define RXB1EIDH_EID14                3249
#define RXB1EID14                     3250
#define RXB1EIDH_EID15                3251
#define RXB1EID15                     3252
#define RXB1EIDL                      3253
#define RXB1EIDL_EID0                 3254
#define RXB1EID0                      3255
#define RXB1EIDL_EID1                 3256
#define RXB1EID1                      3257
#define RXB1EIDL_EID2                 3258
#define RXB1EID2                      3259
#define RXB1EIDL_EID3                 3260
#define RXB1EID3                      3261
#define RXB1EIDL_EID4                 3262
#define RXB1EID4                      3263
#define RXB1EIDL_EID5                 3264
#define RXB1EID5                      3265
#define RXB1EIDL_EID6                 3266
#define RXB1EID6                      3267
#define RXB1EIDL_EID7                 3268
#define RXB1EID7                      3269
#define RXB1DLC                       3270
#define RXB1DLC0                      3271
#define RXB1DLC_DLC0                  3272
#define RXB1DLC1                      3273
#define RXB1DLC_DLC1                  3274
#define RXB1DLC2                      3275
#define RXB1DLC_DLC2                  3276
#define RXB1DLC3                      3277
#define RXB1DLC_DLC3                  3278
#define RXB1RB0                       3279
#define RXB1DLC_RESRB0                3280
#define RXB1DLC_RB0                   3281
#define RXB1RB1                       3282
#define RXB1DLC_RESRB1                3283
#define RXB1DLC_RB1                   3284
#define RXB1DLC_RXRTR                 3285
#define RXB1RTR                       3286
#define RXB1D0                        3287
#define RXB1D00                       3288
#define RXB1D01                       3289
#define RXB1D02                       3290
#define RXB1D03                       3291
#define RXB1D04                       3292
#define RXB1D05                       3293
#define RXB1D06                       3294
#define RXB1D07                       3295
#define RXB1D1                        3296
#define RXB1D10                       3297
#define RXB1D11                       3298
#define RXB1D12                       3299
#define RXB1D13                       3300
#define RXB1D14                       3301
#define RXB1D15                       3302
#define RXB1D16                       3303
#define RXB1D17                       3304
#define RXB1D2                        3305
#define RXB1D20                       3306
#define RXB1D21                       3307
#define RXB1D22                       3308
#define RXB1D23                       3309
#define RXB1D24                       3310
#define RXB1D25                       3311
#define RXB1D26                       3312
#define RXB1D27                       3313
#define RXB1D3                        3314
#define RXB1D30                       3315
#define RXB1D31                       3316
#define RXB1D32                       3317
#define RXB1D33                       3318
#define RXB1D34                       3319
#define RXB1D35                       3320
#define RXB1D36                       3321
#define RXB1D37                       3322
