tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf6680_tdd.h
#define LATD0                         3881
#define LD0                           3882
#define LATD1                         3883
#define LD1                           3884
#define LATD2                         3885
#define LD2                           3886
#define LATD3                         3887
#define LD3                           3888
#define LATD4                         3889
#define LD4                           3890
#define LATD5                         3891
#define LD5                           3892
#define LATD6                         3893
#define LD6                           3894
#define LATD7                         3895
#define LD7                           3896
#define LATE                          3897
#define LATE0                         3898
#define LE0                           3899
#define LATE1                         3900
#define LE1                           3901
#define LATE2                         3902
#define LE2                           3903
#define LATE3                         3904
#define LE3                           3905
#define LATE4                         3906
#define LE4                           3907
#define LATE5                         3908
#define LE5                           3909
#define LATE6                         3910
#define LE6                           3911
#define LATE7                         3912
#define LE7                           3913
#define LATF                          3914
#define LATF0                         3915
#define LF0                           3916
#define LATF1                         3917
#define LF1                           3918
#define LF2                           3919
#define LATF2                         3920
#define LF3                           3921
#define LATF3                         3922
#define LF4                           3923
#define LATF4                         3924
#define LF5                           3925
#define LATF5                         3926
#define LF6                           3927
#define LATF6                         3928
#define LF7                           3929
#define LATF7                         3930
#define LATG                          3931
#define LATG0                         3932
#define LG0                           3933
#define LATG1                         3934
#define LG1                           3935
#define LATG2                         3936
#define LG2                           3937
#define LATG3                         3938
#define LG3                           3939
#define LATG4                         3940
#define LG4                           3941
#define TRISA                         3942
#define TRISA_RA0                     3943
#define TRISA0                        3944
#define TRISA_RA1                     3945
#define TRISA1                        3946
#define TRISA2                        3947
#define TRISA_RA2                     3948
#define TRISA_RA3                     3949
#define TRISA3                        3950
#define TRISA_RA4                     3951
#define TRISA4                        3952
#define TRISA_RA5                     3953
#define TRISA5                        3954
#define TRISA_RA6                     3955
#define TRISA6                        3956
#define TRISB                         3957
#define TRISB_RB0                     3958
#define TRISB0                        3959
#define TRISB_RB1                     3960
#define TRISB1                        3961
#define TRISB_RB2                     3962
#define TRISB2                        3963
#define TRISB_RB3                     3964
#define TRISB3                        3965
#define TRISB_RB4                     3966
#define TRISB4                        3967
#define TRISB_RB5                     3968
#define TRISB5                        3969
#define TRISB_RB6                     3970
#define TRISB6                        3971
#define TRISB_RB7                     3972
#define TRISB7                        3973
#define TRISC                         3974
#define TRISC0                        3975
#define TRISC_RC0                     3976
#define TRISC1                        3977
#define TRISC_RC1                     3978
#define TRISC2                        3979
#define TRISC_RC2                     3980
#define TRISC3                        3981
#define TRISC_RC3                     3982
#define TRISC4                        3983
#define TRISC_RC4                     3984
#define TRISC5                        3985
#define TRISC_RC5                     3986
#define TRISC6                        3987
#define TRISC_RC6                     3988
#define TRISC7                        3989
#define TRISC_RC7                     3990
#define TRISD                         3991
#define TRISD_RD0                     3992
#define TRISD0                        3993
#define TRISD_RD1                     3994
#define TRISD1                        3995
#define TRISD_RD2                     3996
#define TRISD2                        3997
#define TRISD_RD3                     3998
#define TRISD3                        3999
#define TRISD_RD4                     4000
#define TRISD4                        4001
#define TRISD_RD5                     4002
#define TRISD5                        4003
#define TRISD_RD6                     4004
#define TRISD6                        4005
#define TRISD_RD7                     4006
#define TRISD7                        4007
#define TRISE                         4008
#define TRISE_RE0                     4009
#define TRISE0                        4010
#define TRISE1                        4011
#define TRISE_RE1                     4012
#define TRISE2                        4013
#define TRISE_RE2                     4014
#define TRISE_RE3                     4015
#define TRISE3                        4016
#define TRISE_RE4                     4017
#define TRISE4                        4018
#define TRISE_RE5                     4019
#define TRISE5                        4020
#define TRISE_RE6                     4021
#define TRISE6                        4022
#define TRISE_RE7                     4023
#define TRISE7                        4024
#define TRISF                         4025
#define TRISF0                        4026
#define TRISF_RF0                     4027
#define TRISF_RF1                     4028
#define TRISF1                        4029
#define TRISF_RF2                     4030
#define TRISF2                        4031
#define TRISF3                        4032
#define TRISF_RF3                     4033
#define TRISF_RF4                     4034
#define TRISF4                        4035
#define TRISF_RF5                     4036
#define TRISF5                        4037
#define TRISF_RF6                     4038
#define TRISF6                        4039
#define TRISF7                        4040
#define TRISF_RF7                     4041
#define TRISG                         4042
#define TRISG0                        4043
#define TRISG_RG0                     4044
#define TRISG1                        4045
#define TRISG_RG1                     4046
#define TRISG2                        4047
#define TRISG_RG2                     4048
#define TRISG_RG3                     4049
#define TRISG3                        4050
#define TRISG4                        4051
#define TRISG_RG4                     4052
#define PIE1                          4053
#define TMR1IE                        4054
#define TMR2IE                        4055
#define CCP1IE                        4056
#define SSPIE                         4057
#define PIE1_TX1IE                    4058
#define TXIE                          4059
#define RCIE                          4060
#define RC1IE                         4061
#define ADIE                          4062
#define PSPIE                         4063
#define PIR1                          4064
#define TMR1IF                        4065
#define TMR2IF                        4066
#define CCP1IF                        4067
#define SSPIF                         4068
#define TXIF                          4069
#define PIR1_TX1IF                    4070
#define RCIF                          4071
#define RC1IF                         4072
#define ADIF                          4073
#define PSPIF                         4074
#define IPR1                          4075
#define TMR1IP                        4076
#define TMR2IP                        4077
#define CCP1IP                        4078
#define SSPIP                         4079
#define TX1IP                         4080
#define TXIP                          4081
#define RC1IP                         4082
#define RCIP                          4083
#define ADIP                          4084
#define PSPIP                         4085
#define PIE2                          4086
#define CCP2IE                        4087
#define TMR3IE                        4088
#define LVDIE                         4089
#define BCLIE                         4090
#define EEIE                          4091
#define CMIE                          4092
#define PIR2                          4093
#define CCP2IF                        4094
#define TMR3IF                        4095
#define LVDIF                         4096
#define BCLIF                         4097
#define EEIF                          4098
#define CMIF                          4099
#define IPR2                          4100
#define CCP2IP                        4101
#define TMR3IP                        4102
#define LVDIP                         4103
#define BCLIP                         4104
#define EEIP                          4105
#define CMIP                          4106
#define PIE3                          4107
#define FIFOWMIE                      4108
#define PIE3_RXB0IE                   4109
#define RXBnIE                        4110
#define PIE3_RXB1IE                   4111
#define RXBNIE                        4112
#define PIE3_TXB0IE                   4113
#define PIE3_TXB1IE                   4114
#define TXBnIE                        4115
#define PIE3_TXB2IE                   4116
#define TXBNIE                        4117
#define ERRIE                         4118
#define WAKIE                         4119
#define IRXIE                         4120
#define PIR3                          4121
#define FIFOWMIF                      4122
#define RXB0IF                        4123
#define RXBnIF                        4124
#define RXBNIF                        4125
#define RXB1IF                        4126
#define TXB0IF                        4127
#define TXB1IF                        4128
#define TXB2IF                        4129
#define TXBNIF                        4130
#define TXBnIF                        4131
#define ERRIF                         4132
#define WAKIF                         4133
#define IRXIF                         4134
#define IPR3                          4135
#define RXB0IP                        4136
#define FIFOWMIP                      4137
#define RXB1IP                        4138
#define RXBNIP                        4139
#define RXBnIP                        4140
#define TXB0IP                        4141
#define TXB1IP                        4142
#define TXBNIP                        4143
#define TXBnIP                        4144
#define TXB2IP                        4145
#define ERRIP                         4146
#define WAKIP                         4147
#define IRXIP                         4148
#define EECON1                        4149
#define EECON1_RD                     4150
#define EECON1_WR                     4151
#define WREN                          4152
#define WRERR                         4153
#define FREE                          4154
#define CFGS                          4155
#define EEFS                          4156
#define EEPGD                         4157
#define RCSTA                         4158
#define RX9D1                         4159
#define RCD8                          4160
#define RX9D                          4161
#define OERR1                         4162
#define OERR                          4163
#define FERR1                         4164
#define FERR                          4165
#define ADDEN1                        4166
#define ADDEN                         4167
#define ADEN                          4168
#define CREN1                         4169
#define CREN                          4170
#define SREN                          4171
#define SRENA                         4172
#define SREN1                         4173
#define RX91                          4174
#define RX9                           4175
#define RC8_9                         4176
#define RC9                           4177
#define SPEN                          4178
#define SPEN1                         4179
#define TXSTA                         4180
#define TXD8                          4181
#define TX9D1                         4182
#define TX9D                          4183
#define TRMT                          4184
#define TRMT1                         4185
#define BRGH1                         4186
#define BRGH                          4187
#define SENDB1                        4188
#define SENDB                         4189
#define SYNC                          4190
#define SYNC1                         4191
#define TXEN1                         4192
#define TXEN                          4193
#define TX91                          4194
#define TX8_9                         4195
#define TX9                           4196
#define CSRC1                         4197
#define CSRC                          4198
#define PSPCON                        4199
#define PSPMODE                       4200
#define IBOV                          4201
#define OBF                           4202
#define IBF                           4203
#define T3CON                         4204
#define TMR3ON                        4205
#define TMR3CS                        4206
#define nT3SYNC                       4207
#define T3NSYNC                       4208
#define NOT_T3SYNC                    4209
#define T3SYNC                        4210
#define SOSCEN3                       4211
#define T3CCP1                        4212
#define T3CKPS                        4213
#define T3CKPS0                       4214
#define T3CKPS1                       4215
#define T3CCP2                        4216
#define T3CON_RD16                    4217
#define RD163                         4218
#define T3RD16                        4219
#define CMCON                         4220
#define CM                            4221
#define CMEN0                         4222
#define CM0                           4223
#define CMEN1                         4224
#define CM1                           4225
#define CMEN2                         4226
#define CM2                           4227
#define CIS                           4228
#define C1INV                         4229
#define C2INV                         4230
#define C1OUT                         4231
#define C2OUT                         4232
#define CVRCON                        4233
#define CVR                           4234
#define CVR0                          4235
#define CVR1                          4236
#define CVR2                          4237
#define CVR3                          4238
#define CVRSS                         4239
#define CVREF                         4240
#define CVRR                          4241
#define CVROEN                        4242
#define CVROE                         4243
#define CVREN                         4244
#define ECCP1AS                       4245
#define PSSBD                         4246
#define PSSBD0                        4247
#define PSSBD1                        4248
#define PSSAC                         4249
#define PSSAC0                        4250
#define PSSAC1                        4251
#define ECCPAS0                       4252
#define ECCPAS                        4253
#define ECCPAS1                       4254
#define ECCPAS2                       4255
#define ECCPASE                       4256
#define CCP2CON                       4257
#define CCP2M                         4258
#define CCP2M0                        4259
#define CCP2M1                        4260
#define CCP2M2                        4261
#define CCP2M3                        4262
#define DC2B0                         4263
#define DC2B                          4264
#define DC2B1                         4265
#define CCP1CON                       4266
#define CCP1M0                        4267
#define CCP1M                         4268
#define CCP1M1                        4269
#define CCP1M2                        4270
#define CCP1M3                        4271
#define DC1B                          4272
#define DC1B0                         4273
#define DC1B1                         4274
#define P1M                           4275
#define P1M0                          4276
#define P1M1                          4277
#define ADCON2                        4278
#define ADCS0                         4279
#define ADCS                          4280
#define ADCS1                         4281
#define ADCS2                         4282
#define ACQT0                         4283
#define ACQT                          4284
#define ACQT1                         4285
#define ACQT2                         4286
#define ADFM                          4287
#define ADCON1                        4288
#define PCFG0                         4289
#define PCFG                          4290
#define PCFG1                         4291
#define PCFG2                         4292
#define CHSN3                         4293
#define PCFG3                         4294
#define VCFG                          4295
#define VCFG0                         4296
#define VCFG01                        4297
#define VCFG11                        4298
#define VCFG1                         4299
#define ADCON0                        4300
#define ADON                          4301
#define nDONE                         4302
#define GO_nDONE                      4303
#define NOT_DONE                      4304
#define GODONE                        4305
#define GO_DONE                       4306
#define DONE                          4307
#define GO_NOT_DONE                   4308
#define GO                            4309
#define CHS0                          4310
#define CHS                           4311
#define CHS1                          4312
#define CHS2                          4313
#define CHS3                          4314
#define SSPCON2                       4315
#define SEN                           4316
#define RSEN                          4317
#define PEN                           4318
#define RCEN                          4319
#define ACKEN                         4320
#define ACKDT                         4321
#define ACKSTAT                       4322
#define GCEN                          4323
#define SSPCON1                       4324
#define SSPM0                         4325
#define SSPM                          4326
#define SSPM1                         4327
#define SSPM2                         4328
#define SSPM3                         4329
#define CKP                           4330
#define SSPEN                         4331
#define SSPOV                         4332
#define WCOL                          4333
#define SSPSTAT                       4334
#define BF                            4335
#define UA                            4336
#define R_NOT_W                       4337
#define READ_WRITE                    4338
#define NOT_W                         4339
#define R_W                           4340
#define nW                            4341
#define RW                            4342
#define nWRITE                        4343
#define R                             4344
#define NOT_WRITE                     4345
#define R_nW                          4346
#define I2C_READ                      4347
#define START                         4348
#define S                             4349
#define I2C_START                     4350
#define STOP                          4351
#define I2C_STOP                      4352
#define P                             4353
#define NOT_A                         4354
#define DATA_ADDRESS                  4355
#define nA                            4356
#define D_A                           4357
#define D_nA                          4358
#define D                             4359
#define DA                            4360
#define D_NOT_A                       4361
#define NOT_ADDRESS                   4362
#define nADDRESS                      4363
#define I2C_DAT                       4364
#define CKE                           4365
#define SMP                           4366
#define T2CON                         4367
#define T2CKPS0                       4368
#define T2CKPS                        4369
#define T2CKPS1                       4370
#define TMR2ON                        4371
#define T2OUTPS0                      4372
#define TOUTPS                        4373
#define T2OUTPS1                      4374
#define T2OUTPS2                      4375
#define T2OUTPS3                      4376
#define PR2                           4377
#define WM0                           4378
#define WM1                           4379
#define WAIT0                         4380
#define WAIT1                         4381
#define EBDIS                         4382
#define T1CON                         4383
#define TMR1ON                        4384
#define TMR1CS                        4385
#define NOT_T1SYNC                    4386
#define T1SYNC                        4387
#define nT1SYNC                       4388
#define T1INSYNC                      4389
#define T1OSCEN                       4390
#define SOSCEN                        4391
#define T1CKPS0                       4392
#define T1CKPS                        4393
#define T1CKPS1                       4394
#define T1RD16                        4395
#define T1CON_RD16                    4396
#define RCON                          4397
#define BOR                           4398
#define NOT_BOR                       4399
#define nBOR                          4400
#define POR                           4401
#define nPOR                          4402
#define NOT_POR                       4403
#define nPD                           4404
#define NOT_PD                        4405
#define PD                            4406
#define NOT_TO                        4407
#define nTO                           4408
#define TO                            4409
#define nRI                           4410
#define NOT_RI                        4411
#define RI                            4412
#define nIPEN                         4413
#define IPEN                          4414
#define NOT_IPEN                      4415
#define WDTCON                        4416
#define SWDTE                         4417
#define SWDTEN                        4418
#define LVDCON                        4419
#define LVV0                          4420
#define LVDL0                         4421
#define LVDL                          4422
#define LVV1                          4423
#define LVDL1                         4424
#define LVV2                          4425
#define LVDL2                         4426
#define LVV3                          4427
#define LVDL3                         4428
#define LVDEN                         4429
#define BGST                          4430
#define IRVST                         4431
#define OSCCON                        4432
#define SCS0                          4433
#define SCS                           4434
#define SCS1                          4435
#define PLLEN                         4436
#define LOCK                          4437
#define T0CON                         4438
