tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf6680_tdd.h
#define T0PS                          4439
#define T0PS0                         4440
#define T0PS1                         4441
#define T0PS2                         4442
#define PSA                           4443
#define T0SE                          4444
#define T0CS                          4445
#define T08BIT                        4446
#define TMR0ON                        4447
#define STATUS                        4448
#define C                             4449
#define CARRY                         4450
#define DC                            4451
#define ZERO                          4452
#define Z                             4453
#define OV                            4454
#define OVERFLOW                      4455
#define N                             4456
#define NEGATIVE                      4457
#define INTCON3                       4458
#define INT1IF                        4459
#define INT1F                         4460
#define INT2IF                        4461
#define INT2F                         4462
#define INT3F                         4463
#define INT3IF                        4464
#define INT1E                         4465
#define INT1IE                        4466
#define INT2IE                        4467
#define INT2E                         4468
#define INT3E                         4469
#define INT3IE                        4470
#define INT1P                         4471
#define INT1IP                        4472
#define INT2IP                        4473
#define INT2P                         4474
#define INTCON2                       4475
#define RBIP                          4476
#define INT3IP                        4477
#define INT3P                         4478
#define TMR0IP                        4479
#define T0IP                          4480
#define INTEDG3                       4481
#define INTEDG2                       4482
#define INTEDG1                       4483
#define INTEDG0                       4484
#define RBPU                          4485
#define NOT_RBPU                      4486
#define nRBPU                         4487
#define INTCON                        4488
#define RBIF                          4489
#define INT0F                         4490
#define INT0IF                        4491
#define T0IF                          4492
#define TMR0IF                        4493
#define RBIE                          4494
#define INT0E                         4495
#define INT0IE                        4496
#define T0IE                          4497
#define TMR0IE                        4498
#define PEIE                          4499
#define PEIE_GIEL                     4500
#define GIEL                          4501
#define GIE_GIEH                      4502
#define GIE                           4503
#define GIEH                          4504
#define STKPTR0                       4505
#define STKPTR                        4506
#define STKPTR1                       4507
#define STKPTR2                       4508
#define STKPTR3                       4509
#define STKPTR4                       4510
#define STKUNF                        4511
#define STKOVF                        4512
#define STKFUL                        4513

#endif // _PIC18LF6680_H_
